Repository: Nawras-seagull/happyview
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Happy View
ar: المتصفح السعيد

source: Hello
ar: مرحبا

# welcome
source: Welcome to my app
ar: مرحبا بك في تطبيقي

source: Change Language
ar: تغيير اللغة

# settingsTitle
source: Settings
ar: الإعدادات

# profileTitle
source: Profile
ar: الملف الشخصي

# homeTitle
source: Home
ar: الرئيسية

# greeting
source: Hello, {name}
ar: مرحبا، {name}

# itemCount
source: {count, plural, =0{No items} =1{1 item} other{{count} items}}
ar: {count, plural, =0{لا توجد عناصر} =1{عنصر واحد} =2{عنصران} few{{count} عناصر} many{{count} عنصر} other{{count} عنصر}}

# currentDate
source: Today is {date}
ar: اليوم هو {date}

# category_animals
source: Animals
ar: حيوانات

# category_nature
source: Nature
ar: طبيعة

# category_space
source: Space
ar: فضاء

# category_food_drink
source: Food & Drink
ar: طعام ومشروبات

# category_shapes
source: Shapes
ar: أشكال

# category_vehicles
source: Vehicles
ar: مركبات

# category_architecture
source: Architecture
ar: هندسة معمارية

# suprise
source: Surprise me! ðŸŽ‰
ar: 🎉 فاجئني!

source: flowers
ar: 🌸 ورود

source: Mammals
ar: ثدييات

source: Birds
ar: طيور

source: Reptiles
ar: زواحف

source: Sea Creatures
ar: كائنات بحرية

source: Insects
ar: حشرات

source: Amphibians
ar: برمائيات

source: Wildlife
ar: حياة برية

source: Pets
ar: حيوانات أليفة

source: Farm Animals
ar: حيوانات المزرعة

source: Baby Animals
ar: حيوانات صغيرة

source: Trees
ar: أشجار

# flower
source: Flowers
ar: زهور

source: Forests
ar: غابات

source: Mountains
ar: جبال

source: Oceans
ar: محيطات

source: Snow
ar: ثلوج

source: Sunsets
ar: غروب الشمس

source: Waterfalls
ar: شلالات

source: Rivers
ar: أنهار

source: Lakes
ar: بحيرات

source: Leaf
ar: ورقة شجر

source: Planets
ar: كواكب

source: Stars
ar: نجوم

source: Galaxies
ar: مجرات

source: Astronauts
ar: رواد فضاء

source: Buildings
ar: مباني

source: Bridges
ar: جسور

source: Skyscrapers
ar: ناطحات سحاب

source: Houses
ar: منازل

source: Furniture
ar: أثاث

source: Exteriors
ar: الخارجيات

source: Landmarks
ar: معالم

source: Monuments
ar: آثار

source: Towers
ar: أبراج

source: Castles
ar: قلاع

source: Fruits
ar: فواكه

source: Vegetables
ar: خضروات

source: Desserts
ar: حلويات

source: Beverages
ar: مشروبات

source: Fast Food
ar: وجبات سريعة

source: Seafood
ar: مأكولات بحرية

source: Meat
ar: لحوم

source: Dairy
ar: ألبان

source: Baked Goods
ar: مخبوزات

source: Healthy Food
ar: طعام صحي

source: Circles
ar: دوائر

source: Squares
ar: مربعات

source: Triangles
ar: مثلثات

source: Rectangles
ar: مستطيلات

source: Hexagons
ar: سداسيات

source: Hearts
ar: قلوب

source: Spirals
ar: لوالب

source: Diamonds
ar: ألماسات

source: Ovals
ar: أشكال بيضاوية

source: Cars
ar: سيارات

source: Motorcycles
ar: دراجات نارية

source: Trucks
ar: شاحنات

source: Bicycles
ar: دراجات

source: Buses
ar: حافلات

source: Trains
ar: قطارات

source: Airplanes
ar: طائرات

source: Boats
ar: قوارب

source: Helicopters
ar: مروحيات

source: Scooters
ar: دراجات سكوتر

source: Excavators
ar: حفارات

source: Dinosaurs
ar: ديناصورات

source: Subcategories
ar: فئات فرعية

# suggestion_message
source: Thank you for your suggestion!
ar: شكراً لاقتراحاتك

# suggestionTitle
source: Your Suggestion
ar: اقتراحات

# suggestion_placeholder
source: Enter your suggestion here...
ar: اكتب اقتراحك هنا

# suggestionValidationEmpty
source: Please enter a suggestion
ar: الرجاء إدخال اقتراح

# suggestionValidationLength
source: Suggestion must be less than 10 characters
ar: الرجاء إدخال اقتراح لا يقل عن 10 أحرف

# emailLabel
source: Email (optional)
ar: البريد الإلكتروني (اختياري)

# emailHint
source: Enter your email if you want a response
ar: أدخل بريدك الإلكتروني اذا كنت ترغب في تلقي رد

# categoryLabel
source: Category (optional)
ar: الفئة (اختياري)

# categoryHint
source: E.g., Feature Request, Bug Report, etc.
ar: مثال: الحيوانات، الطبيعة، الفضاء

# submit
source: Send Suggestions
ar: إرسال اقتراح

# suggestion_error
source: Enter your suggestion...
ar: اكتب اقتراحك

# suggestion_subtitle
source: Share your thoughts with us
ar: أرسل لنا اقتراحاتك واستفساراتك

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: Close
ar: إغلاق

# verification
source: For parents only
ar: للوالدين فقط

# whatIsSum
source: What is {num1} + {num2}?
ar: ما هو ناتج{num1} + {num2}؟

# incorrect
source: Incorrect answer. Try again.
ar: اجابة خاطئة

# imageIndex
source: Image {index} of {total}
ar: صورة {index} من {total}

source: Storage permission denied
ar: تم رفض إذن الوصول إلى التخزين

source: Image saved to gallery!
ar: تم حفظ الصورة في المعرض!

source: Error
ar: خطأ

source: Failed to decode image
ar: فشل في فك تشفير الصورة

source: Save to gallery
ar: حفظ في المعرض

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية

# privacyPolicySubTitle
source: View our data collection and usage policy
ar: اعرض سياسة خصوصيتنا ومشاركة البيانات

source: View Privacy Policy
ar: عرض سياسة الخصوصية

source: Open Privacy Policy Online
ar: فتح سياسة الخصوصية عبر الإنترنت

# privacyPolicyContent
source: Privacy Policy for Happy View 1. No User Registration - Our app does not require user registration - No personal identifying information is collected 2. Data Collection - Minimal, anonymized data collection via Firebase - Optional analytics and performance tracking - No mandatory user information required 3. Third-Party Services - Unsplash API for images - Firebase for analytics - No personal data sold or shared 4. User Consent - By using the app, you agree to optional data collection - You can disable analytics in device settings 5. Contact For privacy inquiries:developer@nawras.pro
ar: سياسة الخصوصية لتطبيق Happy View 1. لا يوجد تسجيل مستخدم - تطبيقنا لا يتطلب تسجيل المستخدم - لا يتم جمع أي معلومات تعريف شخصية 2. جمع البيانات - جمع بيانات مجهولة الهوية عبر Firebase - تتبع الأداء والتحليلات اختياري - لا توجد معلومات مستخدم إلزامية مطلوبة 3. خدمات الطرف الثالث - واجهة برمجة التطبيقات Unsplash للصور - Firebase للتحليلات - لا يتم بيع أو مشاركة البيانات الشخصية 4. موافقة المستخدم - باستخدام التطبيق، فإنك توافق على جمع البيانات الاختياري - يمكنك تعطيل التحليلات في إعدادات الجهاز 5. الاتصال للاستفسارات المتعلقة بالخصوصية: developer@nawras.pro

source: Search...
ar: بحث

# safeSearch
source: Please enter a safe search term.
ar: البحث الآمن

# safeSearchText
source: Please enter a safe search term.
ar: الرجاء ادخال كلمات آمنة

source: Translated:
ar: ترجمة

# safeSearchEnabled
source: ðŸ”’ Safe search is ON
ar: 🔒 تم تفعيل البحث الآمن
